Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/becoming_seriously_ill.html.txt.tmx
Source language: en
Languages: ga

source: Illness in your retirement
ga: Breoiteacht agus tú imithe ar scor

source: While the vast majority of retired people enjoy a healthy life, there are some who suffer illness and disability and may need care
ga: Cé go mbíonn saol folláin ag formhór na ndaoine ar scor, tá cuid acu a bhíonn faoi bhreoiteacht agus mhíchumas agus d’fhéadfadh cúram a bheith ag teastáil uathu

source: Some may have retired because of the onset of illness or disability
ga: D’fhéadfadh sé gur imigh cuid acu ar scor mar gheall ar theacht na breoiteachta nó an mhíchumais

source: The payments and services to which you are entitled depend on your age and on your needs
ga: Bíonn na híocaíochtaí agus seirbhísí lena bhfuil tú i dteideal ag brath ar d’aois agus do riachtanais

source: The Department of Social Protection (DSP) is responsible for the payments mentioned below except where otherwise stated
ga: Tá an Roinn Coimirce Sóisialaí (RCS) freagrach as na híocaíochtaí thíosluaite a dhéanamh seachas nuair a luaitear a mhalairt

source: Income supports for older people
ga: Tacaíochtaí ioncaim do dhaoine breacaosta

source: If you are already a pensioner when you become ill or acquire a disability, your income arrangements do not change; you continue to receive your pension and other entitlements
ga: Más pinsinéir thú cheana féin nuair a éiríonn tú breoite nó faoi mhíchumas, ní athraíonn do shocruithe ioncaim; faigheann tú do phinsean agus do theidlíochtaí eile fós

source: If you are employed you may continue to be paid by your employer but this depends on your contract of employment
ga: Má tá tú fhostaithe, féadfar go bhfaighidh tú íocaíocht ó d’fhostóir ach bíonn sé seo ag brath ar do chonradh fostaíochta

source: Employers are not obliged to pay employees who are unable to work because of illness but some contracts of employment include provisions for payment while ill
ga: Níl aon oibleagáid ar fhostóirí fostaithe a íoc nach bhfuil in ann obair a dhéanamh mar gheall ar bhreoiteacht ach tá forálacha i gconarthaí fostaíochta áirithe maidir le híocaíocht do dhaoine fad a bhíonn siad breoite

source: This applies regardless of age
ga: Cuirtear i bhfeidhm é seo gan aird ar aois

source: If you become ill and unable to work before the age of 66, you may be eligible for Illness Benefit
ga: Má éiríonn tú breoite agus neamhábalta obair a dhéanamh roimh 66 bliain d’aois, féadfar go mbeidh tú i dteideal Sochar Breoiteachta a fháil

source: Your GP will have application forms
ga: Beidh foirmeacha iarratais ag do LG

source: Illness Benefit is based on PRSI contributions
ga: Tá Sochar Breoiteachta bunaithe ar ranníocaíochtaí ÁSPC

source: If you do not qualify because you do not have enough PRSI contributions or because you are self-employed, you may be eligible for a weekly Supplementary Welfare Allowance
ga: Mura gcáilíonn tú toisc nach bhfuil go leor ranníocaíochtaí ÁSPC agat nó toisc go bhfuil tú féinfhostaithe, féadfar go mbeidh tú incháilithe Liúntas Leasa Forlíontach a fháil ar bhonn seachtainiúil

source: If your illness or disability arises from a work-related accident or illness you may qualify for Occupational Injuries Benefit
ga: Más timpiste a tharla san ionad oibre nó breoiteacht a fuarthas ann a bhí mar chúis le do breoiteacht nó míchumas, d’fhéadfá cáiliú do Shochar Díobhálacha Ceirde

source: Long-term illness and disability
ga: Breoiteacht agus míchumas fadtéarmach

source: If you have a long-term illness or disability and cannot continue to work, you may be able to claim your occupational or personal pension scheme if you have one and you may qualify for Illness Benefit
ga: Má tá breoiteacht nó míchumas fadtéarmach ort agus murar féidir leat leanúint ar aghaidh ag oibriú, féadfar go mbeidh tú in ann do scéim pinsin gairme nó phearsanta a éileamh má tá ceann agat agus in ann cáiliú do Shochar Breoiteachta

source: If you remain unable to work for a year or more you may qualify for Invalidity Pension
ga: Má fhanann tú bheith neamhábalta obair a dhéanamh ar feadh bliana nó níos faide, féadfar go mbeidh tú incháilithe Pinsean Easláinte a fháil

source: If you do not qualify for Illness Benefit or Invalidity Pension, you may apply for the means-tested Disability Allowance
ga: Mura bhfuil tú incháilithe Sochar Breoiteachta nó Pinsean Easláinte a fháil, is féidir leat iarratas a dhéanamh ar an Liúntas Míchumais atá tástáilte ó thaobh maoine de

source: If you qualify for Invalidity Pension or Disability Allowance, you may also qualify for Free Travel and the Household Benefits Package
ga: Má tá tú incháilithe Pinsean Easláinte nó Liúntas Míchumais a fháil, féadfar go mbeidh tú incháilithe Saorthaisteal agus an Pacáiste Sochair Teaghlaigh a fháil chomh maith

source: If you have problems paying your rent, you may be able to get Rent Supplement
ga: Má tá fadhbanna agat maidir le do chíos nó morgáiste a íoc, féadfar go mbeidh tú in ann Forlíonadh Cíosa a fháil

source: The Supplementary Welfare Allowance scheme may also provide help with various costs such as heating, exceptional needs and urgent needs
ga: Féadfaidh an Scéim um Liúntas Leasa Forlíontach cúnamh a sholáthar le costais éagsúla amhail téamh, riachtanais eisceachtúla agus riachtanais phráinneacha

source: There are a number of housing grants available for older people and people with disabilities
ga: Tá roinnt deontais tithíochta ar fáil do dhaoine breacaosta agus do dhaoine faoi mhíchumas

source: If your home needs to be adapted to enable you to continue to live there, you may qualify for the Housing Adaptation Grant for People with a Disability
ga: Má theastaíonn uait do bhaile a oiriúnú le cur ar do chumas fanacht ann, féadfar go mbeidh tú incháilithe an Deontas Oiriúnaithe Tithíochta do Dhaoine faoi Mhíchumas a fháil

source: The adaptations could include adding on an extra room, making the house wheelchair accessible or putting in a ground-floor bathroom and toilet
ga: D’fhéadfadh na hoiriúnuithe seomra breise a chuimsiú, an teach a dhéanamh inrochtana maidir le cathaoir rothaí nó seomra folctha agus leithreas a shuiteáil ar an mbunurlár

source: Apply to your local authority
ga: Déan iarratas ar d’údarás áitiúil

source: The Health Service Executive (HSE) also provides grants under the Housing Aid for Older People Scheme and the Mobility Aids Grant Scheme
ga: Soláthraíonn Feidhmeannacht na Seirbhíse Sláinte (FSS) deontais freisin faoin Scéim um Chúnamh Tithíochta do Dhaoine Breacaosta agus an Scéim Deontas Áiseanna Soghluaisteachta

source: If your own home is unsuitable you may be able to get a specially adapted local authority house for older people and people with disabilities, or an adapted house provided by a voluntary housing organisation
ga: Má tá do theach féin mí-oiriúnach, féadfar go mbeidh tú ábalta teach a fháil ón údarás áitiúil atá curtha in oiriúint go speisialta do dhaoine breacaosta nó do dhaoine faoi mhíchumas, nó teach oiriúnaithe a fháil a chuireann eagraíocht tithíochta dheonach ar fáil

source: The availability of such houses and eligibility for them vary around the country
ga: Bíonn difríochtaí ann maidir lena leithéid de thithe a bheith ar fáil agus a bheith incháilithe ina leith ó áit go háit ar fud na tíre

source: If you are in need of care, the HSE may provide it or help you to pay for it
ga: Má theastaíonn cúram uait, féadfaidh an FSS é a sholáthar nó féadfaidh siad cuidiú leat íoc as

source: Your carer may also be able to get a payment from the Department of Social Protection
ga: Féadfar go mbeidh do chúramóir in ann íocaíocht a fháil ón Roinn Coimirce Sóisialaí chomh maith

source: Help with home care
ga: Cúnamh le cúram sa bhaile

source: If you need support in order to enable you to continue to live at home, you may be able to get help from the Community Care Services section of the HSE
ga: Má theastaíonn cúram uait le cur ar do chumas fanacht i do chónaí sa bhaile, féadfar go mbeidh tú in ann cúnamh a fháil ó rannán Seirbhísí Cúraim don Phobal de chuid FSS

source: The help you may get includes home help and public health nursing
ga: Cuimsíonn an cúnamh a d’fhéadfadh a bheith ar fáil duit cúnamh sa bhaile agus altranas sláinte poiblí

source: The Home Care Package Scheme helps people who need caring support to continue to live at home independently
ga: Scéim um Chúram Baile dírithe go príomha orthu siúd óna dteastaíonn tacaíocht cúraim chun cur ar a gcumas cónaí sa bhaile go neamhspleách

source: You may qualify for tax relief on the costs of employing a carer for a family member, either directly or through an agency
ga: Féadfar go mbeifeá in ann cáiliú d’fhaoiseamh cánach ar chostais cúramóir a fhostú do dhuine muinteartha, cibé acu go díreach nó trí ghníomhaireacht

source: There are income tax reliefs for older people and tax reliefs for people with a disability
ga: Tá faoisimh ó cháin ioncaim do dhaoine breacaosta agus faoisimh chánach do dhaoine faoi mhíchumas ann

source: This is a means-tested payment to people who provide full-time care to a person who is incapacitated
ga: Is íocaíocht atá tástáilte ó thaobh maoine í an íocaíocht seo do dhaoine a sholáthraíonn cúram lánaimseartha do dhuine breacaosta nó do dhuine éagumasaithe

source: Those who look after more than one person may be eligible for an additional 50% of the maximum rate of the payment
ga: Féadfar go mbeidh daoine a thugann cúram do níos mó ná duine amháin incháilithe 50% breise d’uasráta na híocaíochta a fháil

source: If you receive a Carer's Allowance, you may also qualify for Free Travel and the Household Benefits Package
ga: Má fhaigheann tú Liúntas Cúramóra, d'fhéadfadh go mbeifeá incháilithe Saorthaisteal agus an Pacáiste Sochair Teaghlaigh a fháil chomh maith

source: You can work or take education or training courses for up to 15 hours a week, as long as you make adequate arrangements for the care of the person who needs full-time care and attention and inform the Department of Social Protection
ga: Is féidir leat obair a dhéanamh nó cúrsaí oideachais nó oiliúna a dhéanamh a mhéid le 15 huaire in aghaidh na seachtaine, chomh fada agus a dhéanann tú socruithe imleora maidir leis an duine óna dteastaíonn cúram agus aird lánaimseartha agus go gcuirtear iad seo in iúl don Roinn Coimirce Sóisialaí

source: If you are getting certain social welfare payments and you are providing full-time care and attention to another person, you can keep your main social welfare payment and get Half-rate Carer's Allowance
ga: Má tá íocaíochtaí áirithe leasa shóisialaigh á bhfáil agat agus má tá cúram agus aird lánaimseartha á soláthar agat do dhuine eile, féadfaidh tú d’íocaíocht leasa shóisialaigh a choimeád agus Liúntas Cúramóra Leath-Ráta a fháil

source: This is a social insurance payment for people who give up work to care for a person who is incapacitated and who needs full-time care and attention
ga: Is íocaíocht árachais shóisialaigh í seo do dhaoine a éiríonn as obair chun cúram a thabhairt do dhuine éagumasaithe agus óna dteastaíonn cúram agus aird lánaimseartha

source: It may be paid for up to two years and increases are paid if you have child dependants
ga: Is féidir í a íoc ar feadh suas le dhá bhliain agus íoctar méaduithe má tá páistí cleithiúnacha agat

source: If you look after more than one person, you may be eligible for an additional 50% of the maximum payment
ga: Má thugann tú cúram do níos mó ná duine amháin, féadfar go mbeidh tú incháilithe 50% breise d’uasráta na híocaíochta a fháil

source: You must be between the ages of 18 and 66 and have enough PRSI contributions to be eligible for Carer's Benefit
ga: Caithfidh tú a bheith idir 18 agus 66 bliain d’aois agus caithfidh dóthain ranníocaíochtaí ÁSPC a bheith íoctha agat le bheith incháilithe Sochar Cúramóra a fháil

source: You may be eligible for Carer's Leave from your employment
ga: Féadfar go mbeidh tú incháilithe Saoire Chúramóra a fháil ó do chuid fostaíochta

source: You can work or take education or training courses for up to 15 hours a week, as long as you make adequate care arrangements, inform the Department of Social Protection and don't exceed an income limit
ga: Is féidir leat obair a dhéanamh nó cúrsaí oideachais nó oiliúna a dhéanamh a mhéid le 15 huaire in aghaidh na seachtaine, chomh fada agus a dhéanann tú socruithe imleora, agus go gcuirtear iad seo in iúl don Roinn Coimirce Sóisialaí agus nach sáraíonn tú teorainn ioncaim

source: The Respite Care Grant is available to carers providing full-time care to an older person or a person with a disability regardless of means
ga: Tá an Deontas Cúraim Faoisimh ar fáil do gach cúramóir a thugann cúram lánaimseartha do dhuine breacaosta nó do dhuine faoi mhíchumas gan aird ar mhaoin

source: It does not apply to people getting an unemployment payment or those who are working outside the home for more than 15 hours per week
ga: Is iad na daoine amháin a dhéantar a eisiamh ná iad siúd a fhaigheann íocaíocht dífhostaíochta nó iad siúd a oibríonn taobh amuigh den bhaile ar feadh níos mó ná 15 huaire in aghaidh na seachtaine

source: The grant is paid in June each year
ga: Íoctar an deontas i mí an Mheithimh gach bliain

source: You get this payment automatically if you are getting a carer's payment, otherwise apply to the Department of Social Protection
ga: Faigheann tú an íocaíocht seo go huathoibríoch má fhaigheann tú liúntas cúramóra, nó cuir iarratas isteach ar an Roinn Coimirce Sóisialaí

source: Medical card/GP visit card
ga: Cárta leighis/Cárta cuairte LG

source: You may qualify for a medical card
ga: D’fhéadfá cáiliú do chárta leighis

source: If you do not qualify for a medical card because your means are too high, you are automatically assessed for a GP visit card, which has higher income guidelines
ga: Mura gcáilíonn tú do chárta leighis mar gheall go bhfuil do mhaoin ró-ard, déantar measúnú uathoibríoch ort chun Cárta Cuarite LG a fháil, ag a bhfuil teorainneacha ioncaim níos airde

source: Under the Long-Term Illness Scheme drugs, medicines and some approved appliances prescribed for the treatment of certain medical conditions are available free of charge
ga: Faoin Scéim Breoiteachta Fadtéarmaí, tá drugaí, cógais agus roinnt gairis cheadaithe a dhéantar a ordú chun cóir leighis a chur ar riochtaí áirithe míochaine ar fáil saor in aisce

source: If you don't have a medical card the Drugs Payment Scheme covers prescribed drugs and medicines costs that are over a set monthly amount
ga: Mura bhfuil cárta leighis agat, íocann an Scéim Íocaíochta Drugaí as drugaí agus cógais ordaithe atá os cionn suim sheasta mhíosúil

source: Application forms are available from your local pharmacy, Local Health Office or health centre
ga: Tá foirmeacha iarratais ar fáil ó do chógaslann áitiúil, d’Oifig Sláinte Áitiúil nó d’ionad sláinte

source: There are charges for public hospitals, but some people are exempt, including medical card holders
ga: Gearrtar muirir ar ospidéil phoiblí, ach bíonn roinnt daoine díolmhaithe, lena n-áirítear sealbhóirí cárta leighis

source: If you opt for private hospital care, you have to pay the total costs involved
ga: Má roghnaíonn tú cúram ospidéil phríobháidigh, tá ort íoc as na costais iomlána a bheidh i gceist

source: Some or all of these costs may be covered by private health insurance
ga: Féadfar go mbeidh cuid de na costais seo nó na costais iomlána cumhdaithe ag árachas sláinte príobháideach

source: You can claim medical expenses against income tax paid
ga: Is féidir leat costais leighis a éileamh i gcoinne cáin ioncaim atá íoctha

source: You must first make any other claim that you can, for example, from private health insurance
ga: Ar dtús, caithfidh tú aon éileamh eile agus is féidir leat a dhéanamh, mar shampla, ar árachas sláinte príobháideach

source: There is tax relief on the costs of employing a carer for a family member
ga: Tá faoiseamh cánach ar fáil ar chostais cúramóir a fhostú do dhuine muinteartha
